experiments/raw-data/envB-medium-20260505-200033/k6-output.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/medium.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 30 max VUs, 5m0s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 4m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 3 complete and 0 interrupted iterations
default   [   0% ] 01/30 VUs  0m01.0s/4m30.0s

running (0m02.0s), 01/30 VUs, 7 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m02.0s/4m30.0s

running (0m03.0s), 02/30 VUs, 12 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m03.0s/4m30.0s

running (0m04.0s), 02/30 VUs, 16 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m04.0s/4m30.0s

running (0m05.0s), 03/30 VUs, 26 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m05.0s/4m30.0s

running (0m06.0s), 03/30 VUs, 39 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m06.0s/4m30.0s

running (0m07.0s), 04/30 VUs, 44 complete and 0 interrupted iterations
default   [   3% ] 04/30 VUs  0m07.0s/4m30.0s

running (0m08.0s), 04/30 VUs, 44 complete and 0 interrupted iterations
default   [   3% ] 04/30 VUs  0m08.0s/4m30.0s

running (0m09.0s), 05/30 VUs, 51 complete and 0 interrupted iterations
default   [   3% ] 05/30 VUs  0m09.0s/4m30.0s

running (0m10.0s), 05/30 VUs, 68 complete and 0 interrupted iterations
default   [   4% ] 05/30 VUs  0m10.0s/4m30.0s

running (0m11.0s), 06/30 VUs, 86 complete and 0 interrupted iterations
default   [   4% ] 06/30 VUs  0m11.0s/4m30.0s

running (0m12.0s), 06/30 VUs, 103 complete and 0 interrupted iterations
default   [   4% ] 06/30 VUs  0m12.0s/4m30.0s

running (0m13.0s), 07/30 VUs, 120 complete and 0 interrupted iterations
default   [   5% ] 07/30 VUs  0m13.0s/4m30.0s

running (0m14.0s), 07/30 VUs, 142 complete and 0 interrupted iterations
default   [   5% ] 07/30 VUs  0m14.0s/4m30.0s

running (0m15.0s), 08/30 VUs, 168 complete and 0 interrupted iterations
default   [   6% ] 08/30 VUs  0m15.0s/4m30.0s

running (0m16.0s), 08/30 VUs, 195 complete and 0 interrupted iterations
default   [   6% ] 08/30 VUs  0m16.0s/4m30.0s

running (0m17.0s), 09/30 VUs, 203 complete and 0 interrupted iterations
default   [   6% ] 09/30 VUs  0m17.0s/4m30.0s

running (0m18.0s), 09/30 VUs, 203 complete and 0 interrupted iterations
default   [   7% ] 09/30 VUs  0m18.0s/4m30.0s

running (0m19.0s), 10/30 VUs, 211 complete and 0 interrupted iterations
default   [   7% ] 10/30 VUs  0m19.0s/4m30.0s

running (0m20.0s), 10/30 VUs, 217 complete and 0 interrupted iterations
default   [   7% ] 10/30 VUs  0m20.0s/4m30.0s

running (0m21.0s), 11/30 VUs, 217 complete and 0 interrupted iterations
default   [   8% ] 11/30 VUs  0m21.0s/4m30.0s

running (0m22.0s), 11/30 VUs, 227 complete and 0 interrupted iterations
default   [   8% ] 11/30 VUs  0m22.0s/4m30.0s

running (0m23.0s), 12/30 VUs, 260 complete and 0 interrupted iterations
default   [   9% ] 12/30 VUs  0m23.0s/4m30.0s

running (0m24.0s), 12/30 VUs, 286 complete and 0 interrupted iterations
default   [   9% ] 12/30 VUs  0m24.0s/4m30.0s

running (0m25.0s), 13/30 VUs, 327 complete and 0 interrupted iterations
default   [   9% ] 13/30 VUs  0m25.0s/4m30.0s

running (0m26.0s), 13/30 VUs, 368 complete and 0 interrupted iterations
default   [  10% ] 13/30 VUs  0m26.0s/4m30.0s

running (0m27.0s), 14/30 VUs, 405 complete and 0 interrupted iterations
default   [  10% ] 14/30 VUs  0m27.0s/4m30.0s

running (0m28.0s), 14/30 VUs, 436 complete and 0 interrupted iterations
default   [  10% ] 14/30 VUs  0m28.0s/4m30.0s

running (0m29.0s), 15/30 VUs, 446 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m29.0s/4m30.0s

running (0m30.0s), 15/30 VUs, 463 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m30.0s/4m30.0s

running (0m31.0s), 15/30 VUs, 472 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m31.0s/4m30.0s

running (0m32.0s), 16/30 VUs, 473 complete and 0 interrupted iterations
default   [  12% ] 16/30 VUs  0m32.0s/4m30.0s

running (0m33.0s), 16/30 VUs, 475 complete and 0 interrupted iterations
default   [  12% ] 16/30 VUs  0m33.0s/4m30.0s

running (0m34.0s), 17/30 VUs, 502 complete and 0 interrupted iterations
default   [  13% ] 17/30 VUs  0m34.0s/4m30.0s

running (0m35.0s), 17/30 VUs, 565 complete and 0 interrupted iterations
default   [  13% ] 17/30 VUs  0m35.0s/4m30.0s

running (0m36.0s), 18/30 VUs, 610 complete and 0 interrupted iterations
default   [  13% ] 18/30 VUs  0m36.0s/4m30.0s

running (0m37.0s), 18/30 VUs, 610 complete and 0 interrupted iterations
default   [  14% ] 18/30 VUs  0m37.0s/4m30.0s

running (0m38.0s), 19/30 VUs, 616 complete and 0 interrupted iterations
default   [  14% ] 19/30 VUs  0m38.0s/4m30.0s

running (0m39.0s), 19/30 VUs, 648 complete and 0 interrupted iterations
default   [  14% ] 19/30 VUs  0m39.0s/4m30.0s

running (0m40.0s), 20/30 VUs, 648 complete and 0 interrupted iterations
default   [  15% ] 20/30 VUs  0m40.0s/4m30.0s

running (0m41.0s), 20/30 VUs, 652 complete and 0 interrupted iterations
default   [  15% ] 20/30 VUs  0m41.0s/4m30.0s

running (0m42.0s), 21/30 VUs, 683 complete and 0 interrupted iterations
default   [  16% ] 21/30 VUs  0m42.0s/4m30.0s

running (0m43.0s), 21/30 VUs, 707 complete and 0 interrupted iterations
default   [  16% ] 21/30 VUs  0m43.0s/4m30.0s

running (0m44.0s), 22/30 VUs, 711 complete and 0 interrupted iterations
default   [  16% ] 22/30 VUs  0m44.0s/4m30.0s

running (0m45.0s), 22/30 VUs, 736 complete and 0 interrupted iterations
default   [  17% ] 22/30 VUs  0m45.0s/4m30.0s

running (0m46.0s), 23/30 VUs, 754 complete and 0 interrupted iterations
default   [  17% ] 23/30 VUs  0m46.0s/4m30.0s

running (0m47.0s), 23/30 VUs, 754 complete and 0 interrupted iterations
default   [  17% ] 23/30 VUs  0m47.0s/4m30.0s

running (0m48.0s), 24/30 VUs, 784 complete and 0 interrupted iterations
default   [  18% ] 24/30 VUs  0m48.0s/4m30.0s

running (0m49.0s), 24/30 VUs, 801 complete and 0 interrupted iterations
default   [  18% ] 24/30 VUs  0m49.0s/4m30.0s

running (0m50.0s), 25/30 VUs, 811 complete and 0 interrupted iterations
default   [  19% ] 25/30 VUs  0m50.0s/4m30.0s

running (0m51.0s), 25/30 VUs, 815 complete and 0 interrupted iterations
default   [  19% ] 25/30 VUs  0m51.0s/4m30.0s

running (0m52.0s), 26/30 VUs, 820 complete and 0 interrupted iterations
default   [  19% ] 26/30 VUs  0m52.0s/4m30.0s

running (0m53.0s), 26/30 VUs, 825 complete and 0 interrupted iterations
default   [  20% ] 26/30 VUs  0m53.0s/4m30.0s

running (0m54.0s), 27/30 VUs, 832 complete and 0 interrupted iterations
default   [  20% ] 27/30 VUs  0m54.0s/4m30.0s

running (0m55.0s), 27/30 VUs, 843 complete and 0 interrupted iterations
default   [  20% ] 27/30 VUs  0m55.0s/4m30.0s

running (0m56.0s), 28/30 VUs, 875 complete and 0 interrupted iterations
default   [  21% ] 28/30 VUs  0m56.0s/4m30.0s

running (0m57.0s), 28/30 VUs, 919 complete and 0 interrupted iterations
default   [  21% ] 28/30 VUs  0m57.0s/4m30.0s

running (0m58.0s), 29/30 VUs, 957 complete and 0 interrupted iterations
default   [  21% ] 29/30 VUs  0m58.0s/4m30.0s

running (0m59.0s), 29/30 VUs, 962 complete and 0 interrupted iterations
default   [  22% ] 29/30 VUs  0m59.0s/4m30.0s

running (1m00.0s), 29/30 VUs, 966 complete and 0 interrupted iterations
default   [  22% ] 29/30 VUs  1m00.0s/4m30.0s

running (1m01.0s), 30/30 VUs, 984 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m01.0s/4m30.0s

running (1m02.0s), 30/30 VUs, 996 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m02.0s/4m30.0s

running (1m03.0s), 30/30 VUs, 999 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m03.0s/4m30.0s

running (1m04.0s), 30/30 VUs, 1012 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m04.0s/4m30.0s

running (1m05.0s), 30/30 VUs, 1043 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m05.0s/4m30.0s

running (1m06.0s), 30/30 VUs, 1043 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m06.0s/4m30.0s

running (1m07.0s), 30/30 VUs, 1043 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  1m07.0s/4m30.0s

running (1m08.0s), 30/30 VUs, 1104 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  1m08.0s/4m30.0s

running (1m09.0s), 30/30 VUs, 1104 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m09.0s/4m30.0s

running (1m10.0s), 30/30 VUs, 1104 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m10.0s/4m30.0s

running (1m11.0s), 30/30 VUs, 1140 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m11.0s/4m30.0s

running (1m12.0s), 30/30 VUs, 1147 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m12.0s/4m30.0s

running (1m13.0s), 30/30 VUs, 1147 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m13.0s/4m30.0s

running (1m14.0s), 30/30 VUs, 1155 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m14.0s/4m30.0s

running (1m15.0s), 30/30 VUs, 1157 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  1m15.0s/4m30.0s

running (1m16.0s), 30/30 VUs, 1163 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  1m16.0s/4m30.0s

running (1m17.0s), 30/30 VUs, 1185 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m17.0s/4m30.0s

running (1m18.0s), 30/30 VUs, 1215 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m18.0s/4m30.0s

running (1m19.0s), 30/30 VUs, 1251 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m19.0s/4m30.0s

running (1m20.0s), 30/30 VUs, 1264 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m20.0s/4m30.0s

running (1m21.0s), 30/30 VUs, 1264 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m21.0s/4m30.0s

running (1m22.0s), 30/30 VUs, 1289 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m22.0s/4m30.0s

running (1m23.0s), 30/30 VUs, 1323 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m23.0s/4m30.0s

running (1m24.0s), 30/30 VUs, 1351 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m24.0s/4m30.0s

running (1m25.0s), 30/30 VUs, 1402 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m25.0s/4m30.0s

running (1m26.0s), 30/30 VUs, 1425 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  1m26.0s/4m30.0s

running (1m27.0s), 30/30 VUs, 1425 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  1m27.0s/4m30.0s

running (1m28.0s), 30/30 VUs, 1443 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m28.0s/4m30.0s

running (1m29.0s), 30/30 VUs, 1498 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m29.0s/4m30.0s

running (1m30.0s), 30/30 VUs, 1515 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m30.0s/4m30.0s

running (1m31.0s), 30/30 VUs, 1515 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m31.0s/4m30.0s

running (1m32.0s), 30/30 VUs, 1524 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m32.0s/4m30.0s

running (1m33.0s), 30/30 VUs, 1547 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m33.0s/4m30.0s

running (1m34.0s), 30/30 VUs, 1549 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m34.0s/4m30.0s

running (1m35.0s), 30/30 VUs, 1550 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m35.0s/4m30.0s

running (1m36.0s), 30/30 VUs, 1564 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m36.0s/4m30.0s

running (1m37.0s), 30/30 VUs, 1578 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m37.0s/4m30.0s

running (1m38.0s), 30/30 VUs, 1611 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m38.0s/4m30.0s

running (1m39.0s), 30/30 VUs, 1668 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m39.0s/4m30.0s

running (1m40.0s), 30/30 VUs, 1712 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m40.0s/4m30.0s

running (1m41.0s), 30/30 VUs, 1731 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m41.0s/4m30.0s

running (1m42.0s), 30/30 VUs, 1737 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m42.0s/4m30.0s

running (1m43.0s), 30/30 VUs, 1744 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m43.0s/4m30.0s

running (1m44.0s), 30/30 VUs, 1778 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m44.0s/4m30.0s

running (1m45.0s), 30/30 VUs, 1819 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m45.0s/4m30.0s

running (1m46.0s), 30/30 VUs, 1848 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m46.0s/4m30.0s

running (1m47.0s), 30/30 VUs, 1878 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m47.0s/4m30.0s

running (1m48.0s), 30/30 VUs, 1912 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m48.0s/4m30.0s

running (1m49.0s), 30/30 VUs, 1912 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m49.0s/4m30.0s

running (1m50.0s), 30/30 VUs, 1912 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m50.0s/4m30.0s

running (1m51.0s), 30/30 VUs, 1960 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m51.0s/4m30.0s

running (1m52.0s), 30/30 VUs, 1996 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m52.0s/4m30.0s

running (1m53.0s), 30/30 VUs, 2029 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m53.0s/4m30.0s

running (1m54.0s), 30/30 VUs, 2076 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m54.0s/4m30.0s

running (1m55.0s), 30/30 VUs, 2110 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m55.0s/4m30.0s

running (1m56.0s), 30/30 VUs, 2124 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m56.0s/4m30.0s

running (1m57.0s), 30/30 VUs, 2147 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m57.0s/4m30.0s

running (1m58.0s), 30/30 VUs, 2158 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m58.0s/4m30.0s

running (1m59.0s), 30/30 VUs, 2189 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m59.0s/4m30.0s

running (2m00.0s), 30/30 VUs, 2212 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  2m00.0s/4m30.0s

running (2m01.0s), 30/30 VUs, 2212 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  2m01.0s/4m30.0s

running (2m02.0s), 30/30 VUs, 2214 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  2m02.0s/4m30.0s

running (2m03.0s), 30/30 VUs, 2283 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m03.0s/4m30.0s

running (2m04.0s), 30/30 VUs, 2295 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m04.0s/4m30.0s

running (2m05.0s), 30/30 VUs, 2295 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m05.0s/4m30.0s

running (2m06.0s), 30/30 VUs, 2322 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m06.0s/4m30.0s

running (2m07.0s), 30/30 VUs, 2390 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m07.0s/4m30.0s

running (2m08.0s), 30/30 VUs, 2394 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m08.0s/4m30.0s

running (2m09.0s), 30/30 VUs, 2395 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  2m09.0s/4m30.0s

running (2m10.0s), 30/30 VUs, 2436 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  2m10.0s/4m30.0s

running (2m11.0s), 30/30 VUs, 2497 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m11.0s/4m30.0s

running (2m12.0s), 30/30 VUs, 2497 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m12.0s/4m30.0s

running (2m13.0s), 30/30 VUs, 2520 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m13.0s/4m30.0s

running (2m14.0s), 30/30 VUs, 2537 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m14.0s/4m30.0s

running (2m15.0s), 30/30 VUs, 2537 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m15.0s/4m30.0s

running (2m16.0s), 30/30 VUs, 2553 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m16.0s/4m30.0s

running (2m17.0s), 30/30 VUs, 2630 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m17.0s/4m30.0s

running (2m18.0s), 30/30 VUs, 2665 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m18.0s/4m30.0s

running (2m19.0s), 30/30 VUs, 2696 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m19.0s/4m30.0s

running (2m20.0s), 30/30 VUs, 2712 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  2m20.0s/4m30.0s

running (2m21.0s), 30/30 VUs, 2713 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  2m21.0s/4m30.0s

running (2m22.0s), 30/30 VUs, 2718 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m22.0s/4m30.0s

running (2m23.0s), 30/30 VUs, 2791 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m23.0s/4m30.0s

running (2m24.0s), 30/30 VUs, 2835 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m24.0s/4m30.0s

running (2m25.0s), 30/30 VUs, 2865 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m25.0s/4m30.0s

running (2m26.0s), 30/30 VUs, 2898 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m26.0s/4m30.0s

running (2m27.0s), 30/30 VUs, 2901 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m27.0s/4m30.0s

running (2m28.0s), 30/30 VUs, 2902 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  2m28.0s/4m30.0s

running (2m29.0s), 30/30 VUs, 2941 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  2m29.0s/4m30.0s

running (2m30.0s), 30/30 VUs, 2985 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m30.0s/4m30.0s

running (2m31.0s), 30/30 VUs, 2985 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m31.0s/4m30.0s

running (2m32.0s), 30/30 VUs, 2994 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m32.0s/4m30.0s

running (2m33.0s), 30/30 VUs, 3039 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m33.0s/4m30.0s

running (2m34.0s), 30/30 VUs, 3072 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m34.0s/4m30.0s

running (2m35.0s), 30/30 VUs, 3083 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m35.0s/4m30.0s

running (2m36.0s), 30/30 VUs, 3084 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  2m36.0s/4m30.0s

running (2m37.0s), 30/30 VUs, 3087 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  2m37.0s/4m30.0s

running (2m38.0s), 30/30 VUs, 3127 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m38.0s/4m30.0s

running (2m39.0s), 30/30 VUs, 3133 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m39.0s/4m30.0s

running (2m40.0s), 30/30 VUs, 3133 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m40.0s/4m30.0s

running (2m41.0s), 30/30 VUs, 3145 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m41.0s/4m30.0s

running (2m42.0s), 30/30 VUs, 3145 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m42.0s/4m30.0s

running (2m43.0s), 30/30 VUs, 3147 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m43.0s/4m30.0s

running (2m44.0s), 30/30 VUs, 3160 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m44.0s/4m30.0s

running (2m45.0s), 30/30 VUs, 3160 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m45.0s/4m30.0s

running (2m46.0s), 30/30 VUs, 3180 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m46.0s/4m30.0s

running (2m47.0s), 30/30 VUs, 3236 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  2m47.0s/4m30.0s

running (2m48.0s), 30/30 VUs, 3261 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  2m48.0s/4m30.0s

running (2m49.0s), 30/30 VUs, 3269 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m49.0s/4m30.0s

running (2m50.0s), 30/30 VUs, 3284 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m50.0s/4m30.0s

running (2m51.0s), 30/30 VUs, 3290 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m51.0s/4m30.0s

running (2m52.0s), 30/30 VUs, 3313 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m52.0s/4m30.0s

running (2m53.0s), 30/30 VUs, 3342 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m53.0s/4m30.0s

running (2m54.0s), 30/30 VUs, 3342 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m54.0s/4m30.0s

running (2m55.0s), 30/30 VUs, 3344 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  2m55.0s/4m30.0s

running (2m56.0s), 30/30 VUs, 3366 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  2m56.0s/4m30.0s

running (2m57.0s), 30/30 VUs, 3366 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m57.0s/4m30.0s

running (2m58.0s), 30/30 VUs, 3374 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m58.0s/4m30.0s

running (2m59.0s), 30/30 VUs, 3430 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m59.0s/4m30.0s

running (3m00.0s), 30/30 VUs, 3450 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m00.0s/4m30.0s

running (3m01.0s), 30/30 VUs, 3452 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m01.0s/4m30.0s

running (3m02.0s), 30/30 VUs, 3458 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m02.0s/4m30.0s

running (3m03.0s), 30/30 VUs, 3458 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  3m03.0s/4m30.0s

running (3m04.0s), 30/30 VUs, 3458 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  3m04.0s/4m30.0s

running (3m05.0s), 30/30 VUs, 3487 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m05.0s/4m30.0s

running (3m06.0s), 30/30 VUs, 3505 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m06.0s/4m30.0s

running (3m07.0s), 30/30 VUs, 3511 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m07.0s/4m30.0s

running (3m08.0s), 30/30 VUs, 3542 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m08.0s/4m30.0s

running (3m09.0s), 30/30 VUs, 3608 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m09.0s/4m30.0s

running (3m10.0s), 30/30 VUs, 3664 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m10.0s/4m30.0s

running (3m11.0s), 30/30 VUs, 3689 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m11.0s/4m30.0s

running (3m12.0s), 30/30 VUs, 3706 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m12.0s/4m30.0s

running (3m13.0s), 30/30 VUs, 3708 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m13.0s/4m30.0s

running (3m14.0s), 30/30 VUs, 3709 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  3m14.0s/4m30.0s

running (3m15.0s), 30/30 VUs, 3720 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  3m15.0s/4m30.0s

running (3m16.0s), 30/30 VUs, 3720 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m16.0s/4m30.0s

running (3m17.0s), 30/30 VUs, 3724 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m17.0s/4m30.0s

running (3m18.0s), 30/30 VUs, 3782 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m18.0s/4m30.0s

running (3m19.0s), 30/30 VUs, 3802 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m19.0s/4m30.0s

running (3m20.0s), 30/30 VUs, 3802 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m20.0s/4m30.0s

running (3m21.0s), 30/30 VUs, 3840 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m21.0s/4m30.0s

running (3m22.0s), 30/30 VUs, 3853 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  3m22.0s/4m30.0s

running (3m23.0s), 30/30 VUs, 3853 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  3m23.0s/4m30.0s

running (3m24.0s), 30/30 VUs, 3882 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m24.0s/4m30.0s

running (3m25.0s), 30/30 VUs, 3908 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m25.0s/4m30.0s

running (3m26.0s), 30/30 VUs, 3908 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m26.0s/4m30.0s

running (3m27.0s), 30/30 VUs, 3915 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m27.0s/4m30.0s

running (3m28.0s), 30/30 VUs, 3946 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m28.0s/4m30.0s

running (3m29.0s), 30/30 VUs, 3952 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m29.0s/4m30.0s

running (3m30.0s), 30/30 VUs, 3960 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  3m30.0s/4m30.0s

running (3m31.0s), 30/30 VUs, 3969 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  3m31.0s/4m30.0s

running (3m32.0s), 30/30 VUs, 3999 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m32.0s/4m30.0s

running (3m33.0s), 30/30 VUs, 4044 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m33.0s/4m30.0s

running (3m34.0s), 30/30 VUs, 4044 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m34.0s/4m30.0s

running (3m35.0s), 30/30 VUs, 4044 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m35.0s/4m30.0s

running (3m36.0s), 30/30 VUs, 4080 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m36.0s/4m30.0s

running (3m37.0s), 30/30 VUs, 4082 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m37.0s/4m30.0s

running (3m38.0s), 30/30 VUs, 4083 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m38.0s/4m30.0s

running (3m39.0s), 30/30 VUs, 4139 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m39.0s/4m30.0s

running (3m40.0s), 30/30 VUs, 4164 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m40.0s/4m30.0s

running (3m41.0s), 30/30 VUs, 4164 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  3m41.0s/4m30.0s

running (3m42.0s), 30/30 VUs, 4181 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  3m42.0s/4m30.0s

running (3m43.0s), 30/30 VUs, 4214 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m43.0s/4m30.0s

running (3m44.0s), 30/30 VUs, 4250 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m44.0s/4m30.0s

running (3m45.0s), 30/30 VUs, 4299 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m45.0s/4m30.0s

running (3m46.0s), 30/30 VUs, 4382 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m46.0s/4m30.0s

running (3m47.0s), 30/30 VUs, 4438 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m47.0s/4m30.0s

running (3m48.0s), 30/30 VUs, 4453 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m48.0s/4m30.0s

running (3m49.0s), 30/30 VUs, 4465 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  3m49.0s/4m30.0s

running (3m50.0s), 30/30 VUs, 4492 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  3m50.0s/4m30.0s

running (3m51.0s), 30/30 VUs, 4515 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m51.0s/4m30.0s

running (3m52.0s), 30/30 VUs, 4527 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m52.0s/4m30.0s

running (3m53.0s), 30/30 VUs, 4542 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m53.0s/4m30.0s

running (3m54.0s), 30/30 VUs, 4555 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m54.0s/4m30.0s

running (3m55.0s), 30/30 VUs, 4575 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m55.0s/4m30.0s

running (3m56.0s), 30/30 VUs, 4576 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m56.0s/4m30.0s

running (3m57.0s), 30/30 VUs, 4591 complete and 0 interrupted iterations
default   [  88% ] 30/30 VUs  3m57.0s/4m30.0s

running (3m58.0s), 30/30 VUs, 4618 complete and 0 interrupted iterations
default   [  88% ] 30/30 VUs  3m58.0s/4m30.0s

running (3m59.0s), 30/30 VUs, 4622 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  3m59.0s/4m30.0s

running (4m00.0s), 30/30 VUs, 4649 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  4m00.0s/4m30.0s

running (4m01.0s), 30/30 VUs, 4675 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  4m01.0s/4m30.0s

running (4m02.0s), 29/30 VUs, 4698 complete and 0 interrupted iterations
default   [  90% ] 29/30 VUs  4m02.0s/4m30.0s

running (4m03.0s), 29/30 VUs, 4700 complete and 0 interrupted iterations
default   [  90% ] 29/30 VUs  4m03.0s/4m30.0s

running (4m04.0s), 29/30 VUs, 4700 complete and 0 interrupted iterations
default   [  90% ] 29/30 VUs  4m04.0s/4m30.0s

running (4m05.0s), 27/30 VUs, 4725 complete and 0 interrupted iterations
default   [  91% ] 27/30 VUs  4m05.0s/4m30.0s

running (4m06.0s), 25/30 VUs, 4746 complete and 0 interrupted iterations
default   [  91% ] 25/30 VUs  4m06.0s/4m30.0s

running (4m07.0s), 25/30 VUs, 4746 complete and 0 interrupted iterations
default   [  91% ] 25/30 VUs  4m07.0s/4m30.0s

running (4m08.0s), 24/30 VUs, 4759 complete and 0 interrupted iterations
default   [  92% ] 24/30 VUs  4m08.0s/4m30.0s

running (4m09.0s), 23/30 VUs, 4775 complete and 0 interrupted iterations
default   [  92% ] 23/30 VUs  4m09.0s/4m30.0s

running (4m10.0s), 23/30 VUs, 4775 complete and 0 interrupted iterations
default   [  93% ] 23/30 VUs  4m10.0s/4m30.0s

running (4m11.0s), 21/30 VUs, 4787 complete and 0 interrupted iterations
default   [  93% ] 21/30 VUs  4m11.0s/4m30.0s

running (4m12.0s), 20/30 VUs, 4820 complete and 0 interrupted iterations
default   [  93% ] 20/30 VUs  4m12.0s/4m30.0s

running (4m13.0s), 19/30 VUs, 4846 complete and 0 interrupted iterations
default   [  94% ] 19/30 VUs  4m13.0s/4m30.0s

running (4m14.0s), 17/30 VUs, 4862 complete and 0 interrupted iterations
default   [  94% ] 17/30 VUs  4m14.0s/4m30.0s

running (4m15.0s), 16/30 VUs, 4887 complete and 0 interrupted iterations
default   [  94% ] 16/30 VUs  4m15.0s/4m30.0s

running (4m16.0s), 15/30 VUs, 4906 complete and 0 interrupted iterations
default   [  95% ] 15/30 VUs  4m16.0s/4m30.0s

running (4m17.0s), 14/30 VUs, 4935 complete and 0 interrupted iterations
default   [  95% ] 14/30 VUs  4m17.0s/4m30.0s

running (4m18.0s), 13/30 VUs, 4980 complete and 0 interrupted iterations
default   [  96% ] 13/30 VUs  4m18.0s/4m30.0s

running (4m19.0s), 12/30 VUs, 5005 complete and 0 interrupted iterations
default   [  96% ] 12/30 VUs  4m19.0s/4m30.0s

running (4m20.0s), 11/30 VUs, 5012 complete and 0 interrupted iterations
default   [  96% ] 11/30 VUs  4m20.0s/4m30.0s

running (4m21.0s), 11/30 VUs, 5014 complete and 0 interrupted iterations
default   [  97% ] 11/30 VUs  4m21.0s/4m30.0s

running (4m22.0s), 10/30 VUs, 5043 complete and 0 interrupted iterations
default   [  97% ] 10/30 VUs  4m22.0s/4m30.0s

running (4m23.0s), 08/30 VUs, 5071 complete and 0 interrupted iterations
default   [  97% ] 08/30 VUs  4m23.0s/4m30.0s

running (4m24.0s), 07/30 VUs, 5101 complete and 0 interrupted iterations
default   [  98% ] 07/30 VUs  4m24.0s/4m30.0s

running (4m25.0s), 06/30 VUs, 5120 complete and 0 interrupted iterations
default   [  98% ] 06/30 VUs  4m25.0s/4m30.0s

running (4m26.0s), 05/30 VUs, 5129 complete and 0 interrupted iterations
default   [  99% ] 05/30 VUs  4m26.0s/4m30.0s

running (4m27.0s), 05/30 VUs, 5132 complete and 0 interrupted iterations
default   [  99% ] 05/30 VUs  4m27.0s/4m30.0s

running (4m28.0s), 04/30 VUs, 5134 complete and 0 interrupted iterations
default   [  99% ] 04/30 VUs  4m28.0s/4m30.0s

running (4m29.0s), 03/30 VUs, 5142 complete and 0 interrupted iterations
default   [ 100% ] 03/30 VUs  4m29.0s/4m30.0s

running (4m30.0s), 01/30 VUs, 5150 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  4m30.0s/4m30.0s

     ✗ status 200
      ↳  93% — ✓ 4804 / ✗ 347

     checks.........................: 93.26% ✓ 4804      ✗ 347 
     data_received..................: 1.5 MB 5.4 kB/s
     data_sent......................: 917 kB 3.4 kB/s
     http_req_blocked...............: avg=8.26µs  min=1.11µs  med=4.26µs   max=1.19ms   p(90)=7.31µs   p(95)=8.99µs  
     http_req_connecting............: avg=2.05µs  min=0s      med=0s       max=663.18µs p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=1.11s   min=1.32ms  med=548.61ms max=7.52s    p(90)=2.82s    p(95)=3.17s   
       { expected_response:true }...: avg=1.12s   min=21.02ms med=549.89ms max=7.52s    p(90)=2.82s    p(95)=3.17s   
   ✓ http_req_failed................: 6.73%  ✓ 347       ✗ 4804
     http_req_receiving.............: avg=98.52µs min=12.85µs med=85.5µs   max=3.01ms   p(90)=119.39µs p(95)=143.88µs
     http_req_sending...............: avg=35.57µs min=6.49µs  med=31.7µs   max=332.96µs p(90)=60.29µs  p(95)=78.86µs 
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=1.11s   min=1.24ms  med=548.46ms max=7.52s    p(90)=2.82s    p(95)=3.17s   
     http_reqs......................: 5151   19.063403/s
     iteration_duration.............: avg=1.31s   min=80.53ms med=753.57ms max=7.72s    p(90)=3.04s    p(95)=3.38s   
     iterations.....................: 5151   19.063403/s
     test_errors....................: 347    1.284217/s
     test_latency_ms................: avg=1.11s   min=1ms     med=548ms    max=7.52s    p(90)=2.82s    p(95)=3.17s   
     test_slow_requests.............: 1304   4.825991/s
     vus............................: 1      min=1       max=30
     vus_max........................: 30     min=30      max=30


running (4m30.2s), 00/30 VUs, 5151 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s